insert into station (name)
values ('서울역'), ('신도림'), ('시청'), ('종각'), ('종로3가'),
       ('잠실'), ('강변'), ('구의'), ('건대입구'),
       ('충무로'), ('약수'), ('옥수'), ('압구정'),
       ('사당'), ('이수'), ('동작');

insert into line (name, color)
values ('1호선', 'blue'), ('2호선', 'green'), ('3호선', 'brown'), ('4호선', 'skyblue'), ('5호선', 'yellow');

insert into section (line_id, upper_station, lower_station, distance)
values (1, 1, 2, 30), (1, 2, 3, 30), (1, 3, 4, 30), (1, 4, 5, 30),
       (2, 6, 2, 5), (2, 2, 7, 5), (2, 7, 8, 5), (2, 8, 9, 5),
       (3, 10, 8, 5), (3, 8, 11, 5), (3, 11, 12, 5), (3, 12, 13, 5),
       (4, 14, 4, 5), (4, 4, 15, 5), (4, 15, 12, 5), (4, 12, 16, 5)
